ci4/app/Controllers/Artikel.php

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q = $this->request->getVar('q') ?? '';
        $model = new ArtikelModel();
        $data = [
            'title' => $title,
            'q' => $q,
            'artikel' => $model->like('judul', $q)->paginate(1), # data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
WHERE `judul` LIKE '%artikel pertama%' ESCAPE '!'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `artikel`
WHERE `judul` LIKE '%artikel pertama%' ESCAPE '!'